nv-11/benchmark_results/pd-ex-databse/pd-8p8d-gds-r6kdprefill/20251201-022931-bench.log
[2025-12-01 02:29:31] Log file: /benchmark_results/pd-gds-8p8d-h20decode/20251201-022931-bench.log
[2025-12-01 02:29:31] ==========================================
[2025-12-01 02:29:31] PD Benchmark Configuration
[2025-12-01 02:29:31] ==========================================
[2025-12-01 02:29:31] Model: /models/Qwen3-30B-A3B-Instruct-2507-FP8
[2025-12-01 02:29:31] Served Model Name: Qwen3-30B-A3B-Instruct-2507-FP8
[2025-12-01 02:29:31] Base URL: http://localhost:30800
[2025-12-01 02:29:31] Output Directory: /benchmark_results/pd-gds-8p8d-h20decode
[2025-12-01 02:29:31] Case Name: pd-gds-8p8d-h20decode
[2025-12-01 02:29:31] ------------------------------------------
[2025-12-01 02:29:31] Test Type: combined
[2025-12-01 02:29:31] Test Parameters:
[2025-12-01 02:29:31]   Number of Prompts: 160
[2025-12-01 02:29:31]   Request Rate: 128
[2025-12-01 02:29:31]   Decode Output Length: 10
[2025-12-01 02:29:31]   Input Lengths: 100 1000 10000 20000 50000
[2025-12-01 02:29:31]   Base Seed: 45
[2025-12-01 02:29:31] ------------------------------------------
[2025-12-01 02:29:31] Warmup: true
[2025-12-01 02:29:31]   Warmup Prompts: 5
[2025-12-01 02:29:31]   Warmup Input Length: 100
[2025-12-01 02:29:31]   Warmup Seed: 2
[2025-12-01 02:29:31] ==========================================
[2025-12-01 02:29:31] ==========================================
[2025-12-01 02:29:31] Running warmup...
[2025-12-01 02:29:31] ==========================================
/opt/venv/lib/python3.12/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 12-01 02:29:35 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fb97ee002c0>, seed=2, num_prompts=5, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=1, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://localhost:30800', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=1, model='/models/Qwen3-30B-A3B-Instruct-2507-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=['type=warmup'], result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='Qwen3-30B-A3B-Instruct-2507-FP8', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 12-01 02:29:39 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [1, 1]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:00 elapsed, 116:40:08 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 5/5 [00:01<00:00,  3.31it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     5         
Maximum request concurrency:             1         
Benchmark duration (s):                  1.51      
Total input tokens:                      500       
Total generated tokens:                  5         
Request throughput (req/s):              3.31      
Output token throughput (tok/s):         3.31      
Peak output token throughput (tok/s):    4.00      
Peak concurrent requests:                4.00      
Total Token throughput (tok/s):          334.62    
---------------Time to First Token----------------
Mean TTFT (ms):                          300.84    
Median TTFT (ms):                        151.95    
P99 TTFT (ms):                           626.95    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          0.00      
Median TPOT (ms):                        0.00      
P99 TPOT (ms):                           0.00      
---------------Inter-token Latency----------------
Mean ITL (ms):                           0.00      
Median ITL (ms):                         0.00      
P99 ITL (ms):                            0.00      
==================================================
[2025-12-01 02:29:42] Warmup completed
[2025-12-01 02:29:43] ==========================================
[2025-12-01 02:29:43] Starting PD Combined Tests
[2025-12-01 02:29:43] ==========================================
[2025-12-01 02:29:43] IMPORTANT: Ensure the model is deployed in PD mode!
[2025-12-01 02:29:43] ==========================================
[2025-12-01 02:29:43] ------------------------------------------
[2025-12-01 02:29:43] Testing with input_len=100, seed=145
[2025-12-01 02:29:43] ------------------------------------------
[2025-12-01 02:29:43] ==========================================
[2025-12-01 02:29:43] Running PD Combined Test
[2025-12-01 02:29:43] Input Length: 100, Seed: 145
[2025-12-01 02:29:43] ==========================================
[2025-12-01 02:29:43] NOTE: Make sure the model is deployed in PD mode!
/opt/venv/lib/python3.12/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 12-01 02:29:47 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f34b082c400>, seed=145, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=10, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://localhost:30800', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen3-30B-A3B-Instruct-2507-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=128.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=True, metadata=['type=pd,input_len=100,output_len=10'], result_dir=None, result_filename='/benchmark_results/pd-gds-8p8d-h20decode/benchmark_result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='Qwen3-30B-A3B-Instruct-2507-FP8', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 12-01 02:29:51 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [10, 10]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:04 elapsed, 702:29:19 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 128.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 160/160 [00:07<00:00, 21.46it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Request rate configured (RPS):           128.00    
Benchmark duration (s):                  7.45      
Total input tokens:                      15907     
Total generated tokens:                  1600      
Request throughput (req/s):              21.46     
Output token throughput (tok/s):         214.63    
Peak output token throughput (tok/s):    728.00    
Peak concurrent requests:                136.00    
Total Token throughput (tok/s):          2348.42   
---------------Time to First Token----------------
Mean TTFT (ms):                          739.84    
Median TTFT (ms):                        425.16    
P99 TTFT (ms):                           2299.47   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          16.56     
Median TPOT (ms):                        13.29     
P99 TPOT (ms):                           33.17     
---------------Inter-token Latency----------------
Mean ITL (ms):                           17.04     
Median ITL (ms):                         11.40     
P99 ITL (ms):                            74.80     
==================================================
[2025-12-01 02:30:04] PD Combined test completed for input_len=100
[2025-12-01 02:30:06] Completed combined test for input_len=100
[2025-12-01 02:30:06] 
[2025-12-01 02:30:06] ------------------------------------------
[2025-12-01 02:30:06] Testing with input_len=1000, seed=1045
[2025-12-01 02:30:06] ------------------------------------------
[2025-12-01 02:30:06] ==========================================
[2025-12-01 02:30:06] Running PD Combined Test
[2025-12-01 02:30:06] Input Length: 1000, Seed: 1045
[2025-12-01 02:30:06] ==========================================
[2025-12-01 02:30:06] NOTE: Make sure the model is deployed in PD mode!
/opt/venv/lib/python3.12/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 12-01 02:30:09 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7ff0dc3f02c0>, seed=1045, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1000, random_output_len=10, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://localhost:30800', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen3-30B-A3B-Instruct-2507-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=128.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=True, metadata=['type=pd,input_len=1000,output_len=10'], result_dir=None, result_filename='/benchmark_results/pd-gds-8p8d-h20decode/benchmark_result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='Qwen3-30B-A3B-Instruct-2507-FP8', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 12-01 02:30:14 [datasets.py:507] Sampling input_len from [1000, 1000] and output_len from [10, 10]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:05 elapsed, 872:34:04 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 128.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 160/160 [00:03<00:00, 43.07it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Request rate configured (RPS):           128.00    
Benchmark duration (s):                  3.72      
Total input tokens:                      159690    
Total generated tokens:                  1600      
Request throughput (req/s):              43.06     
Output token throughput (tok/s):         430.63    
Peak output token throughput (tok/s):    667.00    
Peak concurrent requests:                124.00    
Total Token throughput (tok/s):          43410.69  
---------------Time to First Token----------------
Mean TTFT (ms):                          1059.40   
Median TTFT (ms):                        681.17    
P99 TTFT (ms):                           2808.19   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          11.92     
Median TPOT (ms):                        11.04     
P99 TPOT (ms):                           20.93     
---------------Inter-token Latency----------------
Mean ITL (ms):                           11.93     
Median ITL (ms):                         10.19     
P99 ITL (ms):                            39.15     
==================================================
[2025-12-01 02:30:25] PD Combined test completed for input_len=1000
[2025-12-01 02:30:27] Completed combined test for input_len=1000
[2025-12-01 02:30:27] 
[2025-12-01 02:30:27] ------------------------------------------
[2025-12-01 02:30:27] Testing with input_len=10000, seed=10045
[2025-12-01 02:30:27] ------------------------------------------
[2025-12-01 02:30:27] ==========================================
[2025-12-01 02:30:27] Running PD Combined Test
[2025-12-01 02:30:27] Input Length: 10000, Seed: 10045
[2025-12-01 02:30:27] ==========================================
[2025-12-01 02:30:27] NOTE: Make sure the model is deployed in PD mode!
/opt/venv/lib/python3.12/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 12-01 02:30:31 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fe693d2c2c0>, seed=10045, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=10000, random_output_len=10, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://localhost:30800', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen3-30B-A3B-Instruct-2507-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=128.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=True, metadata=['type=pd,input_len=10000,output_len=10'], result_dir=None, result_filename='/benchmark_results/pd-gds-8p8d-h20decode/benchmark_result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='Qwen3-30B-A3B-Instruct-2507-FP8', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 12-01 02:30:35 [datasets.py:507] Sampling input_len from [10000, 10000] and output_len from [10, 10]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:02 elapsed, 346:01:41 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 128.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 160/160 [00:17<00:00,  9.29it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Request rate configured (RPS):           128.00    
Benchmark duration (s):                  17.22     
Total input tokens:                      1599978   
Total generated tokens:                  1600      
Request throughput (req/s):              9.29      
Output token throughput (tok/s):         92.94     
Peak output token throughput (tok/s):    188.00    
Peak concurrent requests:                160.00    
Total Token throughput (tok/s):          93032.66  
---------------Time to First Token----------------
Mean TTFT (ms):                          6782.71   
Median TTFT (ms):                        6569.22   
P99 TTFT (ms):                           15234.87  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          13.23     
Median TPOT (ms):                        9.61      
P99 TPOT (ms):                           42.09     
---------------Inter-token Latency----------------
Mean ITL (ms):                           13.23     
Median ITL (ms):                         10.22     
P99 ITL (ms):                            113.84    
==================================================
[2025-12-01 02:31:03] PD Combined test completed for input_len=10000
[2025-12-01 02:31:05] Completed combined test for input_len=10000
[2025-12-01 02:31:05] 
[2025-12-01 02:31:05] ------------------------------------------
[2025-12-01 02:31:05] Testing with input_len=20000, seed=20045
[2025-12-01 02:31:05] ------------------------------------------
[2025-12-01 02:31:05] ==========================================
[2025-12-01 02:31:05] Running PD Combined Test
[2025-12-01 02:31:05] Input Length: 20000, Seed: 20045
[2025-12-01 02:31:05] ==========================================
[2025-12-01 02:31:05] NOTE: Make sure the model is deployed in PD mode!
/opt/venv/lib/python3.12/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 12-01 02:31:08 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f723b32c2c0>, seed=20045, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=20000, random_output_len=10, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://localhost:30800', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen3-30B-A3B-Instruct-2507-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=128.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=True, metadata=['type=pd,input_len=20000,output_len=10'], result_dir=None, result_filename='/benchmark_results/pd-gds-8p8d-h20decode/benchmark_result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='Qwen3-30B-A3B-Instruct-2507-FP8', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 12-01 02:31:13 [datasets.py:507] Sampling input_len from [20000, 20000] and output_len from [10, 10]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:03 elapsed, 882:18:27 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 128.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 160/160 [00:50<00:00,  3.17it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Request rate configured (RPS):           128.00    
Benchmark duration (s):                  50.48     
Total input tokens:                      3200000   
Total generated tokens:                  1600      
Request throughput (req/s):              3.17      
Output token throughput (tok/s):         31.70     
Peak output token throughput (tok/s):    90.00     
Peak concurrent requests:                160.00    
Total Token throughput (tok/s):          63426.20  
---------------Time to First Token----------------
Mean TTFT (ms):                          20612.82  
Median TTFT (ms):                        19484.40  
P99 TTFT (ms):                           47258.04  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          13.59     
Median TPOT (ms):                        9.01      
P99 TPOT (ms):                           54.98     
---------------Inter-token Latency----------------
Mean ITL (ms):                           13.59     
Median ITL (ms):                         10.47     
P99 ITL (ms):                            187.34    
==================================================
[2025-12-01 02:32:20] PD Combined test completed for input_len=20000
[2025-12-01 02:32:22] Completed combined test for input_len=20000
[2025-12-01 02:32:22] 
[2025-12-01 02:32:22] ------------------------------------------
[2025-12-01 02:32:22] Testing with input_len=50000, seed=50045
[2025-12-01 02:32:22] ------------------------------------------
[2025-12-01 02:32:22] ==========================================
[2025-12-01 02:32:22] Running PD Combined Test
[2025-12-01 02:32:22] Input Length: 50000, Seed: 50045
[2025-12-01 02:32:22] ==========================================
[2025-12-01 02:32:22] NOTE: Make sure the model is deployed in PD mode!
/opt/venv/lib/python3.12/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 12-01 02:32:26 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f724726c2c0>, seed=50045, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=50000, random_output_len=10, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://localhost:30800', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen3-30B-A3B-Instruct-2507-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=128.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=True, metadata=['type=pd,input_len=50000,output_len=10'], result_dir=None, result_filename='/benchmark_results/pd-gds-8p8d-h20decode/benchmark_result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='Qwen3-30B-A3B-Instruct-2507-FP8', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 12-01 02:32:30 [datasets.py:507] Sampling input_len from [50000, 50000] and output_len from [10, 10]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:12 elapsed, 2834:02:52 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 128.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 160/160 [06:29<00:00,  2.43s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     158       
Request rate configured (RPS):           128.00    
Benchmark duration (s):                  389.02    
Total input tokens:                      7900000   
Total generated tokens:                  1580      
Request throughput (req/s):              0.41      
Output token throughput (tok/s):         4.06      
Peak output token throughput (tok/s):    91.00     
Peak concurrent requests:                158.00    
Total Token throughput (tok/s):          20311.72  
---------------Time to First Token----------------
Mean TTFT (ms):                          151362.72 
Median TTFT (ms):                        98016.53  
P99 TTFT (ms):                           371452.84 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          49.91     
Median TPOT (ms):                        10.22     
P99 TPOT (ms):                           799.14    
---------------Inter-token Latency----------------
Mean ITL (ms):                           49.91     
Median ITL (ms):                         11.80     
P99 ITL (ms):                            951.51    
==================================================
[2025-12-01 02:39:41] PD Combined test completed for input_len=50000
[2025-12-01 02:39:43] Completed combined test for input_len=50000
[2025-12-01 02:39:43] 
[2025-12-01 02:39:43] ==========================================
[2025-12-01 02:39:43] All PD Combined Tests Completed
[2025-12-01 02:39:43] ==========================================
[2025-12-01 02:39:43] ==========================================
[2025-12-01 02:39:43] Test Results Summary
[2025-12-01 02:39:43] ==========================================
[2025-12-01 02:39:43] Results saved to: /benchmark_results/pd-gds-8p8d-h20decode/benchmark_result.json
[2025-12-01 02:39:43] Result file size: 240K
[2025-12-01 02:39:43] Total test cases: 0
0
[2025-12-01 02:39:43] ==========================================
[2025-12-01 02:39:43] Total execution time: 612 seconds
[2025-12-01 02:39:43] Test completed successfully!